configuration/src/InformationRegisters/СтатусыЗаявокПоСистемамФилиалов/СтатусыЗаявокПоСистемамФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокПоСистемамФилиалов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СтатусыЗаявокПоСистемам/СтатусыЗаявокПоСистемам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокПоСистемам</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/МинимальныеСтатусыЗаявок/МинимальныеСтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныеСтатусыЗаявок</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/СтатусыЗаявокПоСистемамФилиалов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вычисляет статусы заявки по системам для филиалов
//
// Параметры:
//  Заявка  - ДокументСсылка.ЗаявкаНаРазработку - ссылка на документ
//
Процедура Рассчитать(Знач Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ЗаявкаНаРазработкуСистемыРазработки.Ссылка КАК Заявка,
	|	ФилиалыРазрабатываемыеСистемы.Ссылка КАК Филиал,
	|	СтатусыЗаявокПоСистемам.Статус КАК Статус,
	|	СтатусыОбъектов.Порядок КАК ПорядокСтатуса
	|ПОМЕСТИТЬ СтатусПоСистемам
	|ИЗ
	|	Документ.ЗаявкаНаРазработку.СистемыРазработки КАК ЗаявкаНаРазработкуСистемыРазработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПоСистемам КАК СтатусыЗаявокПоСистемам
	|		ПО (СтатусыЗаявокПоСистемам.Заявка = ЗаявкаНаРазработкуСистемыРазработки.Ссылка)
	|			И (СтатусыЗаявокПоСистемам.Система = ЗаявкаНаРазработкуСистемыРазработки.Система)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО (СтатусыЗаявокПоСистемам.Статус = СтатусыОбъектов.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Филиалы.РазрабатываемыеСистемы КАК ФилиалыРазрабатываемыеСистемы
	|		ПО ЗаявкаНаРазработкуСистемыРазработки.Система = ФилиалыРазрабатываемыеСистемы.Система
	|ГДЕ
	|	ЗаявкаНаРазработкуСистемыРазработки.Ссылка = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусПоСистемам.Заявка КАК Заявка,
	|	СтатусПоСистемам.Филиал КАК Филиал,
	|	МИНИМУМ(СтатусПоСистемам.ПорядокСтатуса) КАК ПорядокСтатуса
	|ПОМЕСТИТЬ МинимальныйПорядокСтатусаПоСистемам
	|ИЗ
	|	СтатусПоСистемам КАК СтатусПоСистемам
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусПоСистемам.Заявка,
	|	СтатусПоСистемам.Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусПоСистемам.Заявка КАК Заявка,
	|	СтатусПоСистемам.Филиал КАК Филиал,
	|	МИНИМУМ(СтатусПоСистемам.Статус) КАК Статус
	|ПОМЕСТИТЬ МинимальныйСтатусПоСистемам
	|ИЗ
	|	СтатусПоСистемам КАК СтатусПоСистемам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныйПорядокСтатусаПоСистемам КАК МинимальныйПорядокСтатусаПоСистемам
	|		ПО (МинимальныйПорядокСтатусаПоСистемам.ПорядокСтатуса = СтатусПоСистемам.ПорядокСтатуса)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусПоСистемам.Заявка,
	|	СтатусПоСистемам.Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйСтатусПоСистемам.Заявка КАК Заявка,
	|	МинимальныйСтатусПоСистемам.Филиал КАК Филиал,
	|	МинимальныйСтатусПоСистемам.Статус КАК Статус,
	|	&ТекущаяДата КАК ДатаИзменения
	|ИЗ
	|	МинимальныйСтатусПоСистемам КАК МинимальныйСтатусПоСистемам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныеСтатусыЗаявок КАК МинимальныеСтатусыЗаявок
	|		ПО (МинимальныеСтатусыЗаявок.Заявка = МинимальныйСтатусПоСистемам.Заявка)
	|			И (МинимальныеСтатусыЗаявок.Статус <> МинимальныйСтатусПоСистемам.Статус)";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаЗаписейДляРегистра = РезультатЗапроса.Выгрузить();
		НаборЗаписей.Загрузить(ТаблицаЗаписейДляРегистра);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Вычисляет статусы заявок филиала по системам
//
// Параметры:
//  Филиал  - СправочникСсылка.Филиал - ссылка на филиал
//
Процедура РассчитатьСтатусыПоЗаявкамФилиала(Знач Филиал) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ФилиалыРазрабатываемыеСистемы.Ссылка КАК Филиал,
	|	ЗаявкаНаРазработкуСистемыРазработки.Ссылка КАК Заявка,
	|	СтатусыОбъектов.Порядок КАК ПорядокСтатуса,
	|	СтатусыЗаявокПоСистемам.Статус КАК Статус
	|ПОМЕСТИТЬ СтатусПоСистемам
	|ИЗ
	|	Справочник.Филиалы.РазрабатываемыеСистемы КАК ФилиалыРазрабатываемыеСистемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку.СистемыРазработки КАК ЗаявкаНаРазработкуСистемыРазработки
	|		ПО (ЗаявкаНаРазработкуСистемыРазработки.Система = ФилиалыРазрабатываемыеСистемы.Система)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПоСистемам КАК СтатусыЗаявокПоСистемам
	|		ПО (СтатусыЗаявокПоСистемам.Заявка = ЗаявкаНаРазработкуСистемыРазработки.Ссылка)
	|			И (СтатусыЗаявокПоСистемам.Система = ЗаявкаНаРазработкуСистемыРазработки.Система)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО (СтатусыЗаявокПоСистемам.Статус = СтатусыОбъектов.Ссылка)
	|ГДЕ
	|	ФилиалыРазрабатываемыеСистемы.Ссылка = &Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусПоСистемам.Филиал КАК Филиал,
	|	СтатусПоСистемам.Заявка КАК Заявка,
	|	МИНИМУМ(СтатусПоСистемам.ПорядокСтатуса) КАК ПорядокСтатуса
	|ПОМЕСТИТЬ МинимальныйПорядокПоСистемам
	|ИЗ
	|	СтатусПоСистемам КАК СтатусПоСистемам
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусПоСистемам.Филиал,
	|	СтатусПоСистемам.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусПоСистемам.Филиал КАК Филиал,
	|	СтатусПоСистемам.Заявка КАК Заявка,
	|	МИНИМУМ(СтатусПоСистемам.Статус) КАК Статус
	|ПОМЕСТИТЬ МинимальныйСтатусПоСистемам
	|ИЗ
	|	СтатусПоСистемам КАК СтатусПоСистемам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныйПорядокПоСистемам КАК МинимальныйПорядокПоСистемам
	|		ПО (МинимальныйПорядокПоСистемам.ПорядокСтатуса = СтатусПоСистемам.ПорядокСтатуса)
	|			И (МинимальныйПорядокПоСистемам.Филиал = СтатусПоСистемам.Филиал)
	|			И (МинимальныйПорядокПоСистемам.Заявка = СтатусПоСистемам.Заявка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусПоСистемам.Филиал,
	|	СтатусПоСистемам.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйСтатусПоСистемам.Заявка КАК Заявка,
	|	МинимальныйСтатусПоСистемам.Филиал КАК Филиал,
	|	МинимальныйСтатусПоСистемам.Статус КАК Статус,
	|	&ДатаИзменения КАК ДатаИзменения
	|ИЗ
	|	МинимальныйСтатусПоСистемам КАК МинимальныйСтатусПоСистемам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныеСтатусыЗаявок КАК МинимальныеСтатусыЗаявок
	|		ПО (МинимальныеСтатусыЗаявок.Заявка = МинимальныйСтатусПоСистемам.Заявка)
	|			И МинимальныйСтатусПоСистемам.Статус <> МинимальныеСтатусыЗаявок.Статус";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ДатаИзменения", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Филиал.Установить(Филиал);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаЗаписейДляРегистра = РезультатЗапроса.Выгрузить();
		НаборЗаписей.Загрузить(ТаблицаЗаписейДляРегистра);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет все записи из регистра по указанной заявке
//
// Параметры:
//  Заявка	 - ДокументСсылка.ЗаявкаНаРазработку - Заявка на разработку
//
Процедура УдалитьЗаписиПоЗаявке(Знач Заявка) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
